In [12]:
import pandas as pd
import uuid
from sqlalchemy import create_engine

In [13]:
teams_data = {
    "team_id": [1, 2, 3, 4, 5, 6, 7],
    "team_name": ["Talk Data To Me", "A-Team", "Data Doctors", "NaN", "Group 5", "Group 6", "Staff"]
}
teams = pd.DataFrame(data=teams_data)
teams

   team_id        team_name
0        1  Talk Data To Me
1        2           A-Team
2        3     Data Doctors
3        4              NaN
4        5          Group 5
5        6          Group 6
6        7            Staff

In [14]:
user_data = {
    "user_id": [str(uuid.uuid4()), str(uuid.uuid4())],
    "user_name": ["rebekahCK", "tylerS"],
    "team_id": [7, 7],
    "coins": [100, 100],
    "password": ["password", "password"]
}
users = pd.DataFrame(data=user_data)
users

                                user_id  user_name  team_id  coins  password
0  5a100e52-7c1b-4ffd-aeea-725c65bdce32  rebekahCK        7    100  password
1  110e4741-24a2-43a0-806c-157f3d250ad6     tylerS        7    100  password

In [15]:
user_one = users.iat[0,0]
user_two = users.iat[1,0]
assigned_coins_data = {
    "team_id": [1, 2, 1, 3],
    "user_id": [user_one, user_one, user_two, user_two],
    "coin_amount": [20, 30, 40, 40],
}
assigned_coins = pd.DataFrame(data=assigned_coins_data)
assigned_coins

   team_id                               user_id  coin_amount
0        1  5a100e52-7c1b-4ffd-aeea-725c65bdce32           20
1        2  5a100e52-7c1b-4ffd-aeea-725c65bdce32           30
2        1  110e4741-24a2-43a0-806c-157f3d250ad6           40
3        3  110e4741-24a2-43a0-806c-157f3d250ad6           40

In [16]:
engine = create_engine('sqlite:///shark_tank.db',
                       echo = False)
connection = engine.raw_connection()

# attach the data frame to the sql db
teams.to_sql('teams',
               connection, index=False, if_exists="replace")
users.to_sql("users", connection, index=False, if_exists="replace")
assigned_coins.to_sql("assigned_coins", connection, index=False, if_exists="replace")

# show the complete data from item_info table
print(engine.execute("SELECT * FROM assigned_coins").fetchall())
print(engine.execute("SELECT * FROM teams").fetchall())
print(engine.execute("SELECT * FROM users").fetchall())

[(1, '5a100e52-7c1b-4ffd-aeea-725c65bdce32', 20), (2, '5a100e52-7c1b-4ffd-aeea-725c65bdce32', 30), (1, '110e4741-24a2-43a0-806c-157f3d250ad6', 40), (3, '110e4741-24a2-43a0-806c-157f3d250ad6', 40)]
[(1, 'Talk Data To Me'), (2, 'A-Team'), (3, 'Data Doctors'), (4, 'NaN'), (5, 'Group 5'), (6, 'Group 6'), (7, 'Staff')]
[('5a100e52-7c1b-4ffd-aeea-725c65bdce32', 'rebekahCK', 7, 100, 'password'), ('110e4741-24a2-43a0-806c-157f3d250ad6', 'tylerS', 7, 100, 'password')]